/*************************************************************************
                           TPathArray  -  description
                             -------------------
    début                : $DATE$
    copyright            : (C) $YEAR$ par $AUTHOR$
    e-mail               : $EMAIL$
*************************************************************************/

//---------- Interface du module <TPathArray> (fichier TPathArray.h) -------------------
#if ! defined ( TPATHARRAY_H )
#define TPATHARRAY_H

//------------------------------------------------------------------------
// Rôle du module <TPathArray>
//
//
//------------------------------------------------------------------------

/////////////////////////////////////////////////////////////////  INCLUDE
//--------------------------------------------------- Interfaces utilisées
#include "PathArray.h"
#include "../SimplePath/SimplePath.h"
//------------------------------------------------------------- Constantes

//------------------------------------------------------------------ Types

//////////////////////////////////////////////////////////////////  PUBLIC
//---------------------------------------------------- Fonctions publiques
// type Nom ( liste de paramètres );
// Mode d'emploi :
//
// Contrat :
//
int main();

#endif // TPATHARRAY_H

